#+title: Ps 05
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-04-18>
#+lastmod: <2026-04-19 19:28>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

*** (b)

#+begin_src julia :results value :exports both :tangle julia/p_01.jl
using Plots

# f and ∇f ----------------------------
f(x, y)     = x^2 - y^2
gradf(x, y) = (2x, -2y)

# p1 ----------------------------------
xs = -10:0.05:10
p1 = heatmap(xs, xs, f;
             c = :RdBu,
             aspect_ratio = 1,
             xlims = (-10, 10), ylims = (-10, 10),
             xlabel = "x", ylabel = "y",
             title  = "Level sets and ∇f")

xq   = -10:1:10
pts  = [(x, y) for x in xq, y in xq]
X    = vec([p[1] for p in pts])
Y    = vec([p[2] for p in pts])
UV   = [gradf(p...) for p in pts]
U, V = vec(first.(UV)), vec(last.(UV))
s    = 0.9 * step(xq) / maximum(hypot.(U, V))

quiver!(p1, X, Y; quiver = (s .* U, s .* V), color = :black, linewidth = 1)
scatter!(p1, [0], [0]; color = :black, ms = 5, msw = 0, label = false)

# p2 ----------------------------------
p2 = surface(xs, xs, f;
             alpha  = 0.99,
             color  = :RdBu,
             camera = (30, 30),
             xlabel = "x", ylabel = "y", zlabel = "z",
             title  = "Graph of f")

ts = range(-10, 10, length = 200)
plot3d!(p2, ts, zeros(length(ts)),  ts.^2;  color = :red,  lw = 3, label = "f(t,0) = t²")
plot3d!(p2, zeros(length(ts)), ts, -ts.^2;  color = :blue, lw = 3, label = "f(0,t) = -t²")
scatter!(p2, [0], [0], [0];
         color = :black, markerstrokecolor = :white, markerstrokewidth = 1.5,
         ms = 6, label = "saddle")

# plot --------------------------------
plot(p1, p2; layout = (1, 2), size = (1200, 600))
savefig("./assets/p_01_b.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/01_bachelor/02_semester/01_analysis/02_exercises/set_05/assets/p_01_b.png

*** (c)

The first-order Taylor approximation of $L$ at $x_0$ is

$$\widehat{L}_{x_0}(x) = L(x_0) + DL(x_0)[x - x_0] = \|Ax_0 - b\|^2 + 2\langle A^{*}(Ax_0 - b), x - x_0 \rangle.$$

#+begin_src julia :results output
using LinearAlgebra, Random

let
    function affine_approx(A, b, x0, x)
        r0 = A*x0 - b
        g  = 2 * (A' * r0)
        return dot(r0, r0) + dot(g, x - x0)
    end

    Random.seed!(42)
    A  = randn(20, 3)
    b  = randn(20)
    x0 = randn(3)

    L(x) = sum(abs2, A*x - b)

    println(L(x0))
    println(affine_approx(A, b, x0, x0))

    dx = 1e-3 * randn(3)
    println(L(x0 + dx) - affine_approx(A, b, x0, x0 + dx))
    println(sum(abs2, A*dx))
end
#+end_src

#+RESULTS:
: 86.7136805598037
: 86.7136805598037
: 6.09536959785828e-5
: 6.095369601422723e-5

